[
  {
    "id": 1,
    "title": "Temporada 1",
    "trama": "La trama principal de la primera temporada se centra en la introducción de los personajes y el establecimiento del conflicto central que impulsará la serie. Un joven descubre un artefacto antiguo que le otorga poderes extraordinarios, atrayendo la atención de una organización sombría que busca controlarlo.",
    "numero_capitulos": 2,
    "personajes": [
      "Alex",
      "Draven",
      "Elara",
      "General Kael"
    ],
    "capitulos": [
      {
        "id": 1,
        "title": "Capítulo 1: El Despertar",
        "trama": "En el capítulo 1, Alex aprende a controlar una nueva faceta de sus poderes mientras evade a los agentes de Kael. Elara le proporciona una pista crucial sobre el origen del artefacto.",
        "duracion": "42 min",
        "scenes": [
          {
            "id": 1,
            "title": "ESCENA 1",
            "location": "Apartamento de Alex",
            "time": "NOCHE",
            "characters": [
              "Alex"
            ],
            "action": "Alex está estudiando cuando una extraña luz emana de la caja que encontró en el ático. La abre y descubre el artefacto. Al tocarlo, una oleada de energía lo recorre."
          },
          {
            "id": 2,
            "title": "ESCENA 2",
            "location": "Callejón Oscuro",
            "time": "NOCHE",
            "characters": [
              "Alex",
              "Agente 1",
              "Agente 2"
            ],
            "action": "Alex intenta escapar de dos hombres con trajes oscuros. Accidentalmente, activa el artefacto y crea un escudo de energía que lo protege."
          }
        ]
      },
      {
        "id": 2,
        "title": "Capítulo 2: La Conexión",
        "trama": "Alex busca respuestas y encuentra a Elara, una misteriosa mujer que parece saber mucho sobre el artefacto.",
        "duracion": "45 min",
        "scenes": []
      }
    ]
  },
  {
    "id": 2,
    "title": "Temporada 2",
    "trama": "La segunda temporada explora las consecuencias de las acciones de Alex. Ahora fugitivo, busca aliados para luchar contra la organización de Draven, quien intensifica su persecución y revela tener una conexión personal con el pasado de Alex.",
    "numero_capitulos": 1,
    "personajes": [
      "Alex",
      "Draven",
      "Elara",
      "General Kael",
      "Nia",
      "Rylan"
    ],
    "capitulos": [
      {
        "id": 1,
        "title": "Capítulo 1: Ecos del Pasado",
        "trama": "El capítulo 1 se enfoca en la alianza entre Alex y un grupo de rebeldes liderado por Nia. Juntos, planean un audaz golpe contra una de las bases de Draven.",
        "duracion": "45 min",
        "scenes": []
      }
    ]
  }
]